MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J65/mcu.h
// Register: ETXNDH
#define ETXNDH ETXNDH
extern volatile unsigned char           ETXNDH              __at(0xEE7);
#ifndef _LIB_BUILD
asm("ETXNDH equ 0EE7h");
#endif

// Register: ERXST
#define ERXST ERXST
extern volatile unsigned short          ERXST               __at(0xEE8);
#ifndef _LIB_BUILD
asm("ERXST equ 0EE8h");
#endif

// Register: ERXSTL
#define ERXSTL ERXSTL
extern volatile unsigned char           ERXSTL              __at(0xEE8);
#ifndef _LIB_BUILD
asm("ERXSTL equ 0EE8h");
#endif

// Register: ERXSTH
#define ERXSTH ERXSTH
extern volatile unsigned char           ERXSTH              __at(0xEE9);
#ifndef _LIB_BUILD
asm("ERXSTH equ 0EE9h");
#endif

// Register: ERXND
#define ERXND ERXND
extern volatile unsigned short          ERXND               __at(0xEEA);
#ifndef _LIB_BUILD
asm("ERXND equ 0EEAh");
#endif

// Register: ERXNDL
#define ERXNDL ERXNDL
extern volatile unsigned char           ERXNDL              __at(0xEEA);
#ifndef _LIB_BUILD
asm("ERXNDL equ 0EEAh");
#endif

// Register: ERXNDH
#define ERXNDH ERXNDH
extern volatile unsigned char           ERXNDH              __at(0xEEB);
#ifndef _LIB_BUILD
asm("ERXNDH equ 0EEBh");
#endif

// Register: ERXRDPT
#define ERXRDPT ERXRDPT
extern volatile unsigned short          ERXRDPT             __at(0xEEC);
#ifndef _LIB_BUILD
asm("ERXRDPT equ 0EECh");
#endif

// Register: ERXRDPTL
#define ERXRDPTL ERXRDPTL
extern volatile unsigned char           ERXRDPTL            __at(0xEEC);
#ifndef _LIB_BUILD
asm("ERXRDPTL equ 0EECh");
#endif

// Register: ERXRDPTH
#define ERXRDPTH ERXRDPTH
extern volatile unsigned char           ERXRDPTH            __at(0xEED);
#ifndef _LIB_BUILD
asm("ERXRDPTH equ 0EEDh");
#endif

// Register: ERXWRPT
#define ERXWRPT ERXWRPT
extern volatile unsigned short          ERXWRPT             __at(0xEEE);
#ifndef _LIB_BUILD
asm("ERXWRPT equ 0EEEh");
#endif

// Register: ERXWRPTL
#define ERXWRPTL ERXWRPTL
extern volatile unsigned char           ERXWRPTL            __at(0xEEE);
#ifndef _LIB_BUILD
asm("ERXWRPTL equ 0EEEh");
#endif

// Register: ERXWRPTH
#define ERXWRPTH ERXWRPTH
extern volatile unsigned char           ERXWRPTH            __at(0xEEF);
#ifndef _LIB_BUILD
asm("ERXWRPTH equ 0EEFh");
#endif

// Register: EDMAST
#define EDMAST EDMAST
extern volatile unsigned short          EDMAST              __at(0xEF0);
#ifndef _LIB_BUILD
asm("EDMAST equ 0EF0h");
#endif

// Register: EDMASTL
#define EDMASTL EDMASTL
extern volatile unsigned char           EDMASTL             __at(0xEF0);
#ifndef _LIB_BUILD
asm("EDMASTL equ 0EF0h");
#endif

// Register: EDMASTH
#define EDMASTH EDMASTH
extern volatile unsigned char           EDMASTH             __at(0xEF1);
#ifndef _LIB_BUILD
asm("EDMASTH equ 0EF1h");
#endif

// Register: EDMAND
#define EDMAND EDMAND
extern volatile unsigned short          EDMAND              __at(0xEF2);
#ifndef _LIB_BUILD
asm("EDMAND equ 0EF2h");
#endif

// Register: EDMANDL
#define EDMANDL EDMANDL
extern volatile unsigned char           EDMANDL             __at(0xEF2);
#ifndef _LIB_BUILD
asm("EDMANDL equ 0EF2h");
#endif

// Register: EDMANDH
#define EDMANDH EDMANDH
extern volatile unsigned char           EDMANDH             __at(0xEF3);
#ifndef _LIB_BUILD
asm("EDMANDH equ 0EF3h");
#endif

// Register: EDMADST
#define EDMADST EDMADST
extern volatile unsigned short          EDMADST             __at(0xEF4);
#ifndef _LIB_BUILD
asm("EDMADST equ 0EF4h");
#endif

// Register: EDMADSTL
#define EDMADSTL EDMADSTL
extern volatile unsigned char           EDMADSTL            __at(0xEF4);
#ifndef _LIB_BUILD
asm("EDMADSTL equ 0EF4h");
#endif

// Register: EDMADSTH
#define EDMADSTH EDMADSTH
extern volatile unsigned char           EDMADSTH            __at(0xEF5);
#ifndef _LIB_BUILD
asm("EDMADSTH equ 0EF5h");
#endif

// Register: EDMACS
#define EDMACS EDMACS
extern volatile unsigned short          EDMACS              __at(0xEF6);
#ifndef _LIB_BUILD
asm("EDMACS equ 0EF6h");
#endif

// Register: EDMACSL
#define EDMACSL EDMACSL
extern volatile unsigned char           EDMACSL             __at(0xEF6);
#ifndef _LIB_BUILD
asm("EDMACSL equ 0EF6h");
#endif

// Register: EDMACSH
#define EDMACSH EDMACSH
extern volatile unsigned char           EDMACSH             __at(0xEF7);
#ifndef _LIB_BUILD
asm("EDMACSH equ 0EF7h");
#endif

// Register: EIE
#define EIE EIE
extern volatile unsigned char           EIE                 __at(0xEFB);
#ifndef _LIB_BUILD
asm("EIE equ 0EFBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXERIE                 :1;
        unsigned TXERIE                 :1;
        unsigned                        :1;
        unsigned TXIE                   :1;
        unsigned LINKIE                 :1;
        unsigned DMAIE                  :1;
        unsigned PKTIE                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned ETXIE                  :1;
    };
} EIEbits_t;
extern volatile EIEbits_t EIEbits __at(0xEFB);
// bitfield macros
#define _EIE_RXERIE_POSN                                    0x0
#define _EIE_RXERIE_POSITION                                0x0
#define _EIE_RXERIE_SIZE                                    0x1
#define _EIE_RXERIE_LENGTH                                  0x1
#define _EIE_RXERIE_MASK                                    0x1
#define _EIE_TXERIE_POSN                                    0x1
#define _EIE_TXERIE_POSITION                                0x1
#define _EIE_TXERIE_SIZE                                    0x1
#define _EIE_TXERIE_LENGTH                                  0x1
#define _EIE_TXERIE_MASK                                    0x2
#define _EIE_TXIE_POSN                                      0x3
#define _EIE_TXIE_POSITION                                  0x3
#define _EIE_TXIE_SIZE                                      0x1
#define _EIE_TXIE_LENGTH                                    0x1
#define _EIE_TXIE_MASK                                      0x8
#define _EIE_LINKIE_POSN                                    0x4
#define _EIE_LINKIE_POSITION                                0x4
#define _EIE_LINKIE_SIZE                                    0x1
#define _EIE_LINKIE_LENGTH                                  0x1
#define _EIE_LINKIE_MASK                                    0x10
#define _EIE_DMAIE_POSN                                     0x5
#define _EIE_DMAIE_POSITION                                 0x5
#define _EIE_DMAIE_SIZE                                     0x1
#define _EIE_DMAIE_LENGTH                                   0x1
#define _EIE_DMAIE_MASK                                     0x20
#define _EIE_PKTIE_POSN                                     0x6
#define _EIE_PKTIE_POSITION                                 0x6
#define _EIE_PKTIE_SIZE                                     0x1
#define _EIE_PKTIE_LENGTH                                   0x1
#define _EIE_PKTIE_MASK                                     0x40
#define _EIE_ETXIE_POSN                                     0x3
#define _EIE_ETXIE_POSITION                                 0x3
#define _EIE_ETXIE_SIZE                                     0x1
#define _EIE_ETXIE_LENGTH                                   0x1
#define _EIE_ETXIE_MASK                                     0x8

// Register: ESTAT
#define ESTAT ESTAT
extern volatile unsigned char           ESTAT               __at(0xEFD);
#ifndef _LIB_BUILD
asm("ESTAT equ 0EFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHYRDY                 :1;
        unsigned TXABRT                 :1;
        unsigned RXBUSY                 :1;
        unsigned                        :2;
        unsigned                        :1;
        unsigned BUFER                  :1;
    };
} ESTATbits_t;
extern volatile ESTATbits_t ESTATbits __at(0xEFD);
// bitfield macros
#define _ESTAT_PHYRDY_POSN                                  0x0
#define _ESTAT_PHYRDY_POSITION                              0x0
#define _ESTAT_PHYRDY_SIZE                                  0x1
#define _ESTAT_PHYRDY_LENGTH                                0x1
#define _ESTAT_PHYRDY_MASK                                  0x1
#define _ESTAT_TXABRT_POSN                                  0x1
#define _ESTAT_TXABRT_POSITION                              0x1
#define _ESTAT_TXABRT_SIZE                                  0x1
#define _ESTAT_TXABRT_LENGTH                                0x1
#define _ESTAT_TXABRT_MASK                                  0x2
#define _ESTAT_RXBUSY_POSN                                  0x2
#define _ESTAT_RXBUSY_POSITION                              0x2
#define _ESTAT_RXBUSY_SIZE                                  0x1
#define _ESTAT_RXBUSY_LENGTH                                0x1
#define _ESTAT_RXBUSY_MASK                                  0x4
#define _ESTAT_BUFER_POSN                                   0x6
#define _ESTAT_BUFER_POSITION                               0x6
#define _ESTAT_BUFER_SIZE                                   0x1
#define _ESTAT_BUFER_LENGTH                                 0x1
#define _ESTAT_BUFER_MASK                                   0x40

// Register: ECON2
#define ECON2 ECON2
extern volatile unsigned char           ECON2               __at(0xEFE);
#ifndef _LIB_BUILD
asm("ECON2 equ 0EFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned ETHEN                  :1;
        unsigned PKTDEC                 :1;
        unsigned AUTOINC                :1;
    };
} ECON2bits_t;
extern volatile ECON2bits_t ECON2bits __at(0xEFE);
// bitfield macros
#define _ECON2_ETHEN_POSN                                   0x5
#define _ECON2_ETHEN_POSITION                               0x5
#define _ECON2_ETHEN_SIZE                                   0x1
#define _ECON2_ETHEN_LENGTH                                 0x1
#define _ECON2_ETHEN_MASK                                   0x20
#define _ECON2_PKTDEC_POSN                                  0x6
#define _ECON2_PKTDEC_POSITION                              0x6
#define _ECON2_PKTDEC_SIZE                                  0x1
#define _ECON2_PKTDEC_LENGTH                                0x1
#define _ECON2_PKTDEC_MASK                                  0x40
#define _ECON2_AUTOINC_POSN                                 0x7
#define _ECON2_AUTOINC_POSITION                             0x7
#define _ECON2_AUTOINC_SIZE                                 0x1
#define _ECON2_AUTOINC_LENGTH                               0x1
#define _ECON2_AUTOINC_MASK                                 0x80

// Register: EIR
#define EIR EIR
extern volatile unsigned char           EIR                 __at(0xF60);
#ifndef _LIB_BUILD
asm("EIR equ 0F60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXERIF                 :1;
        unsigned TXERIF                 :1;
        unsigned                        :1;
        unsigned TXIF                   :1;
        unsigned LINKIF                 :1;
        unsigned DMAIF                  :1;
        unsigned PKTIF                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned ETXIF                  :1;
    };
} EIRbits_t;
extern volatile EIRbits_t EIRbits __at(0xF60);
// bitfield macros
#define _EIR_RXERIF_POSN                                    0x0
#define _EIR_RXERIF_POSITION                                0x0
#define _EIR_RXERIF_SIZE                                    0x1
#define _EIR_RXERIF_LENGTH                                  0x1
#define _EIR_RXERIF_MASK                                    0x1
#define _EIR_TXERIF_POSN                                    0x1
#define _EIR_TXERIF_POSITION                                0x1
#define _EIR_TXERIF_SIZE                                    0x1
#define _EIR_TXERIF_LENGTH                                  0x1
#define _EIR_TXERIF_MASK                                    0x2
#define _EIR_TXIF_POSN                                      0x3
#define _EIR_TXIF_POSITION                                  0x3
#define _EIR_TXIF_SIZE                                      0x1
#define _EIR_TXIF_LENGTH                                    0x1
#define _EIR_TXIF_MASK                                      0x8
#define _EIR_LINKIF_POSN                                    0x4
#define _EIR_LINKIF_POSITION                                0x4
#define _EIR_LINKIF_SIZE                                    0x1
#define _EIR_LINKIF_LENGTH                                  0x1
#define _EIR_LINKIF_MASK                                    0x10
#define _EIR_DMAIF_POSN                                     0x5
#define _EIR_DMAIF_POSITION                                 0x5
#define _EIR_DMAIF_SIZE                                     0x1
#define _EIR_DMAIF_LENGTH                                   0x1
#define _EIR_DMAIF_MASK                                     0x20
#define _EIR_PKTIF_POSN                                     0x6
#define _EIR_PKTIF_POSITION                                 0x6
#define _EIR_PKTIF_SIZE                                     0x1
#define _EIR_PKTIF_LENGTH                                   0x1
#define _EIR_PKTIF_MASK                                     0x40
#define _EIR_ETXIF_POSN                                     0x3
#define _EIR_ETXIF_POSITION                                 0x3
#define _EIR_ETXIF_SIZE                                     0x1
#define _EIR_ETXIF_LENGTH                                   0x1
#define _EIR_ETXIF_MASK                                     0x8

// Register: EDATA
#define EDATA EDATA
extern volatile unsigned char           EDATA               __at(0xF61);
#ifndef _LIB_BUILD
asm("EDATA equ 0F61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EDATA0                 :1;
        unsigned EDATA1                 :1;
        unsigned EDATA2                 :1;
        unsigned EDATA3                 :1;
        unsigned EDATA4                 :1;
        unsigned EDATA5                 :1;
        unsigned EDATA6                 :1;
        unsigned EDATA7                 :1;
    };
} EDATAbits_t;
extern volatile EDATAbits_t EDATAbits __at(0xF61);
// bitfield macros
#define _EDATA_EDATA0_POSN                                  0x0
#define _EDATA_EDATA0_POSITION                              0x0
#define _EDATA_EDATA0_SIZE                                  0x1
#define _EDATA_EDATA0_LENGTH                                0x1
#define _EDATA_EDATA0_MASK                                  0x1
#define _EDATA_EDATA1_POSN                                  0x1
#define _EDATA_EDATA1_POSITION                              0x1
#define _EDATA_EDATA1_SIZE                                  0x1
#define _EDATA_EDATA1_LENGTH                                0x1
#define _EDATA_EDATA1_MASK                                  0x2
#define _EDATA_EDATA2_POSN                                  0x2
#define _EDATA_EDATA2_POSITION                              0x2
#define _EDATA_EDATA2_SIZE                                  0x1
#define _EDATA_EDATA2_LENGTH                                0x1
#define _EDATA_EDATA2_MASK                                  0x4
#define _EDATA_EDATA3_POSN                                  0x3
#define _EDATA_EDATA3_POSITION                              0x3
#define _EDATA_EDATA3_SIZE                                  0x1
#define _EDATA_EDATA3_LENGTH                                0x1
#define _EDATA_EDATA3_MASK                                  0x8
#define _EDATA_EDATA4_POSN                                  0x4
#define _EDATA_EDATA4_POSITION                              0x4
#define _EDATA_EDATA4_SIZE                                  0x1
#define _EDATA_EDATA4_LENGTH                                0x1
#define _EDATA_EDATA4_MASK                                  0x10
#define _EDATA_EDATA5_POSN                                  0x5
#define _EDATA_EDATA5_POSITION                              0x5
#define _EDATA_EDATA5_SIZE                                  0x1
#define _EDATA_EDATA5_LENGTH                                0x1
#define _EDATA_EDATA5_MASK                                  0x20
#define _EDATA_EDATA6_POSN                                  0x6
#define _EDATA_EDATA6_POSITION                              0x6
#define _EDATA_EDATA6_SIZE                                  0x1
#define _EDATA_EDATA6_LENGTH                                0x1
#define _EDATA_EDATA6_MASK                                  0x40
#define _EDATA_EDATA7_POSN                                  0x7
#define _EDATA_EDATA7_POSITION                              0x7
#define _EDATA_EDATA7_SIZE                                  0x1
#define _EDATA_EDATA7_LENGTH                                0x1
#define _EDATA_EDATA7_MASK                                  0x80

// Register: SSP2CON2
#define SSP2CON2 SSP2CON2
extern volatile unsigned char           SSP2CON2            __at(0xF62);
#ifndef _LIB_BUILD
asm("SSP2CON2 equ 0F62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEN                    :1;
        unsigned RSEN                   :1;
        unsigned PEN                    :1;
        unsigned RCEN                   :1;
        unsigned ACKEN                  :1;
        unsigned ACKDT                  :1;
        unsigned ACKSTAT                :1;
        unsigned GCEN                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned ADMSK1                 :1;
        unsigned ADMSK2                 :1;
        unsigned ADMSK3                 :1;
        unsigned ADMSK4                 :1;
        unsigned ADMSK5                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned ADMSK                  :5;
    };
    struct {
        unsigned SEN2                   :1;
        unsigned RSEN2                  :1;
        unsigned PEN2                   :1;
        unsigned RCEN2                  :1;
        unsigned ACKEN2                 :1;
        unsigned ACKDT2                 :1;
        unsigned ACKSTAT2               :1;
        unsigned GCEN2                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned ADMSK12                :1;
        unsigned ADMSK22                :1;
        unsigned ADMSK32                :1;
        unsigned ADMSK42                :1;
        unsigned ADMSK52                :1;
    };
} SSP2CON2bits_t;
