MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J65/mcu.h
extern volatile __bit                   nSS2                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 nSS2_bit            _BIT_ACCESS(PORTD,7)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// RCON<nTO>
extern volatile __bit                   nTO                 __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 nTO_bit             _BIT_ACCESS(RCON,3)
// PORTJ<nUB>
extern volatile __bit                   nUB                 __at(0x7C47);	// @ (0xF88 * 8 + 7)
#define                                 nUB_bit             _BIT_ACCESS(PORTJ,7)
// SSP2STAT<nW2>
extern volatile __bit                   nW2                 __at(0x7B22);	// @ (0xF64 * 8 + 2)
#define                                 nW2_bit             _BIT_ACCESS(SSP2STAT,2)
// PORTE<nWR>
extern volatile __bit                   nWR                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 nWR_bit             _BIT_ACCESS(PORTE,1)
// PORTJ<nWRH>
extern volatile __bit                   nWRH                __at(0x7C43);	// @ (0xF88 * 8 + 3)
#define                                 nWRH_bit            _BIT_ACCESS(PORTJ,3)
// SSP2STAT<nWRITE2>
extern volatile __bit                   nWRITE2             __at(0x7B22);	// @ (0xF64 * 8 + 2)
#define                                 nWRITE2_bit         _BIT_ACCESS(SSP2STAT,2)
// PORTJ<nWRL>
extern volatile __bit                   nWRL                __at(0x7C42);	// @ (0xF88 * 8 + 2)
#define                                 nWRL_bit            _BIT_ACCESS(PORTJ,2)

#endif // _PIC18F96J65_H_
